app/Controllers/Atributos.php

UPDATE `atributos` SET `denominacion` = 'altura', `tipo_dato` = '2', `fecha_edicion` = '2026-08-09 18:08:32'
WHERE `atributos`.`id` IN ('1')
---
    public function insertar(){

        if(!isset($this->sesion->id)){
            return redirect()->to(base_url() . "registro/");
        }

        header('Content-Type: application/json');

        $denominacion = strtolower(trim($this->request->getPost('denominacion')));
        $tipoDato = strtolower(trim($this->request->getPost('tipo_dato')));


        if (!$denominacion  || !$tipoDato) {
            echo "faltan datos obligatorios";
            return;
        }

        $datoAtributo = $this->atributos->where('denominacion', $denominacion)->withDeleted()->first();

        if (!$datoAtributo) {
            $this->atributos->save([
                'denominacion' => $denominacion,
                'tipo_dato'    => $tipoDato,
            ]);