app/Controllers/Clientes.php

    public function index()
    {
        $clientes = $this->clientes->findAll();
---
SELECT *
FROM `clientes`